In [1]:
import pandas as pd
import numpy as np

In [5]:
# Change filename for prepared mesh here:
filename = 'test_lemb_v2_4141nodes'

full_filename = 'prepared_meshes/' + filename
nodes = pd.read_csv(full_filename  + '/nodes_df.csv', sep=',', names=['nid', 'x', 'y'])

elem_names = ['eid', 'pid'] + ['n'+str(i) for i in range(1, 5)]
elements = pd.read_csv(full_filename + '/elements_df.csv', sep=',',
                       names=elem_names)

#### Здесь можно посмотреть, на то какие элементы, где находятся, чтобы понимать куда прикладывать силу, куда записывать граничные условия и т.д.

In [6]:
max(nodes.nid.values)

4141

In [6]:
max(nodes.x)

3.0

In [4]:
nodes[(nodes.nid == 18)]

    nid         x    y
32   18  0.555556  2.0

In [7]:
elements[elements.eid == 51]

    eid  pid  n1  n2   n3   n4
50   51    1  52  53  331  330

In [9]:
nodes[nodes.nid == 52]

     nid    x    y
100   52  0.0  2.0

In [10]:
nodes[nodes.x >= 4]

     nid        x        y
0      1  5.00000  2.00000
1      3  4.72222  2.00000
2    103  4.72222  1.73333
3    102  5.00000  1.73333
4      4  4.44444  2.00000
..   ...      ...      ...
521  560  4.16667 -1.73333
555   88  4.72222 -2.00000
556   53  5.00000 -2.00000
557   87  4.44444 -2.00000
558   86  4.16667 -2.00000

[64 rows x 3 columns]

In [38]:
elements[elements.n4 == 89]

     eid  pid  n1   n2   n3  n4
468  469    1  90  523  558  89

In [35]:
nodes[nodes.nid == 90]

     nid    x        y
482   90  5.0 -1.46667

In [18]:
nodes[nodes.nid == 52]

     nid    x        y
554   52 -5.0 -1.73333

In [16]:
nodes[nodes.nid == 120]

    nid             x        y
37  120  1.110220e-16  1.73333

In [7]:
nodes[nodes.x >= 2]

    nid        x    y
0     1  3.00000  1.5
1     3  2.14286  1.5
2    21  2.14286  0.5
3    20  3.00000  0.5
16   27  2.14286 -0.5
17   19  3.00000 -0.5
24   18  2.14286 -1.5
25   12  3.00000 -1.5

In [50]:
nodes[nodes.nid == 330]

     nid             x    y
101  330 -8.326670e-17  1.9

In [28]:
elements[elements.n1 == 52].iloc[:, 2:].values[0]

array([ 52,  53, 331, 330])

In [33]:
nodes[(nodes.y == 1) & (nodes.x == 0)]

       nid    x    y
1060  1221  0.0  1.0